# WallUtils Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
WallUtils Class
Members See Also
---
General Wall utility methods
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public static class WallUtils
```

Visual Basic
---
```text
Public NotInheritable Class WallUtils
```

Visual C++
---
```text
public ref class WallUtils abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..WallUtils
# See Also
WallUtils Members
Autodesk.Revit.DB Namespace